package Java0.Method;
/*Создайте метод public static void printHelloWorld(), который будет выводить в консоль строку “Hello world!”.
        Требования:
        1. Метод должен иметь модификатор static
2. Метод не должен принимать параметры
        3. Метод должен выводить в консоль строку “Hello world!”
        4. Метод не должен ничего возвращать*/
public class PZ_2_4_2 {
    public static void printHelloWorld() {
        System.out.println("Hello world!");
    }


}
