package Java0.Примитивные_типы;

public class PZ_2_2_2 {
    public static void main(String[] args) {
        int varint=5;
        boolean varboolean = true;
        double vardouble =5.5;
        long varlong =11111111L;
        short varshort =-10;
        byte varbyte=10;
        float varfloat =3.14f;
        char varchar = 'A';
        System.out.println();

    }
}
/*В методе main (точка входа в программу) объявите переменные всех простых(примитивных) типов. Проинициализируйте их значениями отличными от значений по умолчанию.

Требования:
1. Переменные должны находиться внутри метода main
2. В методе main должны быть переменные всех простых типов
3. В методе main должны быть переменные только простых типов
4. Значения переменных должны отличаться от значений по умолчанию
5. Переменные должны иметь имя var + тип примитива без пробелов и подчеркиваний (например, переменная типа int должна называться varint)*/